mmalecki/DroneBridge-ESP32/main/main.c
#ifdef CONFIG_ENABLE_CAMERA
        NVS_GET(u8, CAM_PIN_PWDN);
        NVS_GET(u8, CAM_PIN_RESET);
        NVS_GET(u8, CAM_PIN_XCLK);
        NVS_GET(u8, CAM_PIN_SIOD); 
        NVS_GET(u8, CAM_PIN_SIOC); 
        NVS_GET(u8, CAM_PIN_Y9);   
        NVS_GET(u8, CAM_PIN_Y8);  
        NVS_GET(u8, CAM_PIN_Y7);  
        NVS_GET(u8, CAM_PIN_Y6);  
        NVS_GET(u8, CAM_PIN_Y5);  
        NVS_GET(u8, CAM_PIN_Y4);  
        NVS_GET(u8, CAM_PIN_Y3);  
        NVS_GET(u8, CAM_PIN_Y2);  
        NVS_GET(u8, CAM_PIN_VSYNC);
        NVS_GET(u8, CAM_PIN_HREF);
        NVS_GET(u8, CAM_PIN_PCLK);
        NVS_GET(i32, CAM_XCLK_FREQ);
        NVS_GET(u8, CAM_FPS);
        NVS_GET(u8, CAM_JPG_QUALITY);
        NVS_GET(u8, CAM_FRAME_SIZE);
#endif

        nvs_close(my_handle);
        ESP_LOGI(TAG,
                 "\tWifi Mode: %i\n\twifi_chan %i\n\tbaud %liu\n\tgpio_tx %i\n\tgpio_rx %i\n\tgpio_cts %i\n\t"
                 "gpio_rts %i\n\trts_thresh %i\n\tproto %i\n\ttrans_pack_size %i\n\tltm_per_packet %i",
                 DB_WIFI_MODE, DB_WIFI_CHANNEL, DB_UART_BAUD_RATE, DB_UART_PIN_TX, DB_UART_PIN_RX,
                 DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL, DB_TRANS_BUF_SIZE,
                 DB_LTM_FRAME_NUM_BUFFER);
    }
}

/**
 * Callback for a short press (<CONFIG_BUTTON_SHORT_PRESS_TIME_MS) of the reset/boot button.
 * Sets mode to WiFi access point mode with default password "dronebridge" so user can check/change the config
 * @param arg
 */
void short_press_callback(void *arg,void *usr_data) {
    ESP_LOGW(TAG, "Short press detected setting wifi mode to access point with password: dronebridge");
    DB_WIFI_MODE = DB_WIFI_MODE_AP;
    strncpy((char *) DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
    write_settings_to_nvs();
    restart();
}

/**
 * Callback for a long press (>CONFIG_BUTTON_LONG_PRESS_TIME_MS) of the reset/boot button.
 * Resets all settings to defaults.
 * @param arg
 */
void long_press_callback(void *arg,void *usr_data) {
    ESP_LOGW(TAG, "Reset triggered via GPIO %i. Resetting settings and rebooting", DB_RESET_PIN);
    DB_WIFI_MODE = DB_WIFI_MODE_AP;
    strncpy((char *) DB_WIFI_SSID, "DroneBridge for ESP32", sizeof(DB_WIFI_SSID) - 1);
    strncpy((char *) DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
    strncpy(DEFAULT_AP_IP, "192.168.2.1", sizeof(DEFAULT_AP_IP) - 1);
    memset(DB_STATIC_STA_IP, 0, strlen(DB_STATIC_STA_IP));
    memset(DB_STATIC_STA_IP_GW, 0, strlen(DB_STATIC_STA_IP_GW));
    memset(DB_STATIC_STA_IP_NETMASK, 0, strlen(DB_STATIC_STA_IP_NETMASK));
    DB_WIFI_CHANNEL = 6;
    DB_UART_PIN_TX = GPIO_NUM_0;
    DB_UART_PIN_RX = GPIO_NUM_0;
    DB_UART_PIN_CTS = GPIO_NUM_0;
    DB_UART_PIN_RTS = GPIO_NUM_0;
    DB_SERIAL_PROTOCOL = 4;
    DB_TRANS_BUF_SIZE = 64;
    DB_UART_RTS_THRESH = 64;
    write_settings_to_nvs();
    restart();
}

/**
 * Setup boot button GPIO to reset entire ESP32 settings and to force a reboot of the system
 */
void set_reset_trigger() {
    button_config_t gpio_btn_cfg = {
            .type = BUTTON_TYPE_GPIO,
            .long_press_time = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
            .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
            .gpio_button_config = {
                    .gpio_num = DB_RESET_PIN,
                    .active_level = 0,
            },
    };
    button_handle_t gpio_btn = iot_button_create(&gpio_btn_cfg);
    if(NULL == gpio_btn) {
        ESP_LOGE(TAG, "Creating reset button failed");
    } else {
        iot_button_register_cb(gpio_btn, BUTTON_SINGLE_CLICK, short_press_callback,NULL);
        iot_button_register_cb(gpio_btn, BUTTON_LONG_PRESS_UP, long_press_callback,NULL);
    }
}

/**
 * Main entry point.
 * Client Mode: ESP32 connects to a known access point.
 * If the ESP32 could not connect to the specified access point using WIFI_ESP_MAXIMUM_RETRY retries, the
 * ESP32 will switch temporarily to access point mode to allow the user to check the configuration. On reboot of the
 * ESP32 the WiFi client mode will be re-enabled if not changed otherwise by the user.
 *
 * AP-Mode: ESP32 creates an WiFi access point of its own where the ground control stations can connect
 */
void app_main() {
    udp_conn_list = udp_client_list_create();   // http server functions expect the list to exist
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    read_settings_nvs();
    set_reset_trigger();
    if (DB_WIFI_MODE == DB_WIFI_MODE_AP || DB_WIFI_MODE == DB_WIFI_MODE_AP_LR) {
        init_wifi_apmode(DB_WIFI_MODE);
    } else if (DB_WIFI_MODE == DB_WIFI_MODE_ESPNOW_AIR || DB_WIFI_MODE == DB_WIFI_MODE_ESPNOW_GND) {
        init_wifi_espnow();
        db_espnow_module();
    } else {
        // Wi-Fi client mode with LR mode enabled
        if (init_wifi_clientmode() < 0) {
            ESP_LOGW(TAG, "Switching to failsafe: Enabling access point mode");
            // De-Init all Wi-Fi and enable the AP-Mode temporarily
            ESP_ERROR_CHECK(esp_event_loop_delete_default());
            esp_netif_destroy_default_wifi(esp_default_netif);
            ESP_ERROR_CHECK(esp_wifi_stop());
            strncpy((char *) DB_WIFI_SSID, "Failsafe DroneBridge ESP32", sizeof(DB_WIFI_SSID));
            strncpy((char *) DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD));
            init_wifi_apmode(DB_WIFI_MODE_AP);
        }
    }

    if (DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_GND) {
        // no need to start these services - won`t be available anyway - safe the resources
        start_mdns_service();
        netbiosns_init();
        netbiosns_set_name("dronebridge");
    }

    ESP_ERROR_CHECK(init_fs());

#ifdef CONFIG_ENABLE_CAMERA
    camera_init();
#endif
    control_module();

    if (DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_GND) {
        // no need to start these services - won`t be available anyway - safe the resources
        ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
        // Disable legacy support for DroneBridge communication module - no use case for DroneBridge for ESP32
        // communication_module();
    }
}

void restart() {
#ifdef CONFIG_ENABLE_CAMERA
    esp_camera_deinit();
#endif
    esp_restart();
}
